benchmark/FieldExamples/iterativeCouplingDummyCSMAndOF/idealizedPiston/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
  
  
    fsiWall
    {
       type            movingWallVelocity;
        //type            slip;
       value           uniform (0 0 0);
    }

    fixedWallZ
    {
        type            slip;
    }
    
    fixedWallX
    {
        type            slip;
    }

    fixedWallYOutlet
    {
        type            zeroGradient;
    }
    
}

// ************************************************************************* //