benchmark/FieldExamples/iterativeCouplingDummyCSMAndOF/idealizedPiston/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    pcorr
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-12;
        relTol          0;
    }

    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-12;
        relTol          0.0;
    }

    pFinal
    {
        $p;
        tolerance       1e-12;
        relTol          0;
    }

    U
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-12;
        relTol          0.0;
    }

    UFinal
    {
        $U;
        tolerance       1e-12;
        relTol          0;
    }

    cellMotionU
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-12;
        relTol          0;
    }
    
    cellDisplacement
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-12;
        relTol          0;
    }
}

PIMPLE
{
    correctPhi          on;
    momentumPredictor   on;
    ddtPhiCorr          on;
    checkMeshCourantNo  on;
    nOuterCorrectors    100;
    nCorrectors         2;
    nNonOrthogonalCorrectors 2;
    pRefCell        0;
    pRefValue       0;
    residualControl
    {
      p
      {
	      tolerance 1e-5;
	      relTol 0;
	      absTol 0;
      }
    }
}

relaxationFactors
{
    "U.*"           1;
}

// ************************************************************************* //
